T = [20 25 30 35 40 45 50 55 60 65 70 75 80 85 90 95 100];%C
% T = T+273.15;%K
VF = [0.588 0.574 0.562 0.551 0.539 0.527 0.516 0.505 0.493...
    0.481 0.469 0.457 0.445 0.433 0.423 0.409 0.397];%V
VF = VF.*10^3;%mV

n = polyfit(T,VF,1);
x = 20:0.1:100;
S = n(1);
Vg0 = n(2);
y = S.*x+Vg0;

% S = num2str(S);
% Vg0 = num2str(Vg0);
% tex1 = ['V_{F}=ST+V_{g(0)}'];
% tex2 = ['S=',S,'mV/^{o}C'];
% tex3 = ['V_{g(0)}=',Vg0,'mV'];
% 
% plot(x,y);
% xlabel('T/^{o}C');
% ylabel('VF/mV');
% text(30,5*10^2,tex1);
% text(30,4.8*10^2,tex2);
% text(30,4.6*10^2,tex3);
% title('ÉýÎÂT-V_{F}Í¼Ïñ');
% hold on;
% scatter(T,VF);




